-- phpMyAdmin SQL Dump
-- version 4.4.12
-- http://www.phpmyadmin.net
--
-- Host: 127.0.0.1
-- Generation Time: 2017-03-18 20:53:02
-- 服务器版本： 5.6.25
-- PHP Version: 5.6.11

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `test`
--

-- --------------------------------------------------------

--
-- 表的结构 `yhwc`
--

CREATE TABLE IF NOT EXISTS `yhwc` (
  `id` int(10) unsigned NOT NULL,
  `name` varchar(20) CHARACTER SET utf8 NOT NULL,
  `tips` varchar(30) CHARACTER SET utf8 NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=145 DEFAULT CHARSET=latin1;

--
-- 转存表中的数据 `yhwc`
--

INSERT INTO `yhwc` (`id`, `name`, `tips`) VALUES
(1, '落井下石', '成语、4 个字'),
(2, '画饼充饥', '成语、4 个字'),
(3, '虎头蛇尾', '成语、4 个字'),
(4, '捧腹大笑 ', '成语、4 个字'),
(5, '泪流满面 ', '成语、4 个字'),
(6, '画蛇添足', '成语、4 个字'),
(7, '一手遮天 ', '成语、4 个字'),
(8, '羊入虎口', '成语、4 个字'),
(9, '掩耳盗铃', '成语、4 个字'),
(10, '新婚之夜', '成语、4 个字'),
(11, '虾兵蟹将', '成语、4 个字'),
(12, '胆小如鼠', '成语、4 个字'),
(13, '对牛弹琴', '成语、4 个字'),
(14, '回眸一笑', '成语、4 个字'),
(15, '九牛一毛', '成语、4 个字'),
(16, '泥牛下海', '成语、4 个字'),
(17, '一手遮天', '成语、4 个字'),
(18, '藏龙卧虎', '成语、4 个字'),
(19, '饿虎扑食', '成语、4 个字'),
(20, '放虎归山', '成语、4 个字'),
(21, '猪狗不如', '成语、4 个字'),
(22, '水中捞月', '成语、4 个字'),
(23, '井底之蛙', '成语、4 个字'),
(24, '兔死狐悲', '成语、4 个字'),
(25, '守株待兔', '成语、4 个字'),
(26, '乘龙快婿', '成语、4 个字'),
(27, '龙潭虎穴', '成语、4 个字'),
(28, '死不瞑目', '成语、4 个字'),
(29, '画龙点睛', '成语、4 个字'),
(30, '杯弓蛇影', '成语、4 个字'),
(31, '牛鬼蛇神', '成语、4 个字'),
(32, '拔草寻蛇', '成语、4 个字'),
(33, '兵荒马乱', '成语、4 个字'),
(34, '单枪匹马', '成语、4 个字'),
(35, '快马加鞭', '成语、4 个字'),
(36, '顺手牵羊', '成语、4 个字'),
(37, '马不停蹄', '成语、4 个字'),
(38, '亡羊补牢', '成语、4 个字'),
(39, '杀鸡儆猴', '成语、4 个字'),
(40, '鸡飞狗跳', '成语、4 个字'),
(61, '布娃娃', '三个字，儿童玩具'),
(62, '餐巾纸', '餐具'),
(63, '大脖子病', '四个字个字，一种病症'),
(64, '仓库', '两个字，建筑类'),
(65, ' 丁字裤', '三个字，一种内衣'),
(66, 'CD', '两个字母，一种数据存储'),
(67, '蜂蜜', '两个字，食品类'),
(68, '瓷器', '两个字，容器类'),
(69, '三峡大坝', '四个字，水利工程类'),
(70, '沙漏', '两个字，计时器类'),
(71, '除草剂', '三个字，清除作用的药物'),
(72, '不入虎穴焉得虎子', '八个字，俗语'),
(73, '树苗', '两个字，植物类'),
(74, '手术刀', '三个字，医疗器械'),
(75, '豆沙包', '三个字，食品'),
(76, '射雕英雄传', '五个字，古代小说'),
(77, '耳机', '两个字，电子产品'),
(78, '飞碟', '两个字，交通工具'),
(79, '工资', '两个字，劳动所得'),
(80, '蟾蜍', '两个字，五毒之一'),
(81, '泳衣', '两个字，服装类'),
(82, '呲牙咧嘴', '四个字，一种表情'),
(83, '酒鬼', '两个字，形容一个人的嗜好'),
(84, '外星人', '三个字，一种未知生物'),
(85, '通心菜', '三个字，蔬菜类'),
(86, '人民币', '三个字，货币类'),
(87, '手纸', '两个字，日用品'),
(88, '雷人', '两个字，网络语'),
(89, '淘宝', '两个字，电商'),
(90, '原子弹', '三个字，武器类'),
(91, '娃哈哈', '三个字，儿童饮料'),
(92, '仙人掌', '三个字，植物'),
(93, '疯子', '两个字，非正常人类'),
(94, '城管', '两个字，一种现代职业'),
(95, '凤姐', '两个字，网络名人'),
(96, '钓鱼岛', '三个字，中国固有领土'),
(97, '靖国神社', '四个字，被称为岛国神侧'),
(98, '口吃', '两个字，病症'),
(99, '冰雹', '两个字，天气术语'),
(100, '僵尸', '两个字，神话人物'),
(101, '齐白石', '三个字，艺术家名字'),
(102, '打火机', '三个字，日用品'),
(103, ' 同流合污', '四个字，成语'),
(104, '山楂', '两个字，水果'),
(105, '牛奶', '两个字，饮品'),
(106, '蹦极', '两个字，体育运动'),
(107, '刘翔', '两个字，人名'),
(108, '奶牛', '两个字，动物类'),
(109, '色迷迷', '三个字，形容一种表情'),
(110, '钓鱼', '两个字，一种运动'),
(111, '花仙子', '三个字，神话人物'),
(112, '兔女郎', '三个字，一种角色'),
(113, '董存瑞', '三个字，历史人物'),
(114, '日环食', '三个字，天文现象'),
(115, '击剑', '两个字，体育比赛'),
(116, '挖鼻屎', '三个字，一种行为'),
(117, '监狱', '两个字，一种场合'),
(118, '结婚证', '三个字，一种证件'),
(119, '空格键', '三个字，电子部件'),
(120, 'KTV', '三个字母，一种场合'),
(121, '插排', '两个字，家用电器'),
(122, '秦始皇兵马俑', '六个字，文物古迹'),
(123, '汉堡', '两个字，食品'),
(124, '沙僧', '两个字，神话人物'),
(125, '圣经', '两个字，书籍类'),
(126, '升旗', '两个字，行为类'),
(127, '钻戒', '两个字，首饰类'),
(128, '米老鼠', '三个字，动画人物'),
(129, '天文望远镜', '五个字，一种光学仪器'),
(130, '水漫金山', '四个字，神话故事'),
(131, '盗墓', '两个字，一种非法行为'),
(132, '春梦', '两个字，一种生理现象'),
(133, '贞子', '两个字，神话人物'),
(134, ' 入洞房', '三个字，人生乐事之一'),
(135, '别墅', '两个字，建筑类'),
(136, '人造卫星', '四个字，人造天体'),
(137, 'WC', '两个字母，一种场所'),
(138, ' 草泥马', '三个字，一种动物'),
(139, '帅哥', '两个字，一种美称'),
(140, '司马光', '三个字，古代小英雄'),
(141, '眼镜框', '三个字，饰品'),
(142, '洲际导弹', '四个字，远程武器'),
(143, '孟婆汤', '三个字，一种消除记忆的饮料'),
(144, '灰太狼', '三个字，动画人物');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `yhwc`
--
ALTER TABLE `yhwc`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `name` (`name`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `yhwc`
--
ALTER TABLE `yhwc`
  MODIFY `id` int(10) unsigned NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=145;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
